---
kind: method
id: M:Autodesk.Revit.UI.IExternalEventHandler.GetName
source: html/323cd266-3fe4-6efe-1b0b-fe55d368e7cb.htm
---
# Autodesk.Revit.UI.IExternalEventHandler.GetName Method

String identification of the event handler.

## Syntax (C#)
```csharp
string GetName()
```

## Returns
The event's name